app/Controllers/ActivityController.php

    public function enterActivity()
    {

        $activityModel = new ActivityModel();
        $activities = $activityModel->findAll();
---
SELECT *
FROM `activities`

    public function calculateFood()
    {
        $session = session();
        $userId = $session->get('user_id');

        // Validation de la session utilisateur
        if (!$userId) {
            return redirect()->to('/entrer-donnees-personnelles')->with('error', 'Veuillez entrer vos informations personnelles.');
        }

        // Récupérer les données du formulaire
        $activityName = $this->request->getPost('activite');
        $duration     = $this->request->getPost('duree');

        // Validation des données
        if (!$this->validate([
            'activite' => 'required',
            'duree' => 'required|numeric',
        ])) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        // Recherche de l'activité dans la base de données
        $activityModel = new ActivityModel();
        $activity = $activityModel->where('nom', $activityName)->first();
---
SELECT *
FROM `activities`
WHERE `nom` = 'yoga'
 LIMIT 1


        // Récupérer les données utilisateur pour les calculs
        $userModel = new UserModel();
        $user = $userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = 2

            'quantite' => $duration,
            'calories' => $caloriesBurned,
        ];
        $recordModel->insert($recordData);

        // Recherche de la nourriture équivalente
        $foodModel = new FoodModel();
        $foods = $foodModel->findAll();
---
INSERT INTO `records` (`user_id`, `type`, `item_id`, `quantite`, `calories`, `created_at`) VALUES (2, 'activite', '4', '20', 22.75, '2024-09-26 09:22:32')
SELECT *
FROM `foods`