app/Controllers/FoodController.php

SELECT *
FROM `foods`
---
    public function enterFood()
    {
        $foodModel = new FoodModel();
        $foods = $foodModel->findAll();

SELECT *
FROM `foods`
WHERE `nom` = 'banane'
 LIMIT 1
---
    public function calculateActivity()
    {
        $session = session();
        $userId = $session->get('user_id');

        // Validation de la session utilisateur
        if (!$userId) {
            return redirect()->to('/entrer-donnees-personnelles')->with('error', 'Veuillez entrer vos informations personnelles.');
        }

        // Récupérer les données du formulaire
        $foodName = $this->request->getPost('aliment');
        $quantity = $this->request->getPost('quantite');

        // Validation des données
        if (!$this->validate([
            'aliment' => 'required',
            'quantite' => 'required|numeric',
        ])) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        // Recherche de l'aliment dans la base de données
        $foodModel = new FoodModel();
        $food = $foodModel->where('nom', $foodName)->first();

INSERT INTO `records` (`user_id`, `type`, `item_id`, `quantite`, `calories`, `created_at`) VALUES (2, 'nourriture', '2', '20', 17.8, '2024-09-26 09:23:11')
SELECT *
FROM `users`
WHERE `users`.`id` = 2
---
            'quantite' => $quantity,
            'calories' => $caloriesIngested,
        ];
        $recordModel->insert($recordData);

        // Récupérer les données utilisateur pour les calculs
        $userModel = new UserModel();
        $user = $userModel->find($userId);

SELECT *
FROM `activities`
---

        // Recherche de l'activité recommandée
        $activityModel = new ActivityModel();
        $activities = $activityModel->findAll();