app/Controllers/RankingController.php

    public function index()
    {
        $recordModel = new RecordModel();
        $userModel = new UserModel();

        // Classement des gros mangeurs
        $eaters = $recordModel->select('user_id, SUM(calories) as total_calories')
            ->where('type', 'nourriture')
            ->groupBy('user_id')
            ->orderBy('total_calories', 'DESC')
            ->findAll(10);

        // Ajout des noms d'utilisateurs
        foreach ($eaters as &$eater) {
            $user = $userModel->find($eater['user_id']);
            $eater['nom'] = 'Utilisateur ' . $user['id']; // Vous pouvez personnaliser cela
        }

        // Classement des plus sportifs
        $athletes = $recordModel->select('user_id, SUM(calories) as total_calories')
            ->where('type', 'activite')
            ->groupBy('user_id')
            ->orderBy('total_calories', 'DESC')
            ->findAll(10);

        foreach ($athletes as &$athlete) {
            $user = $userModel->find($athlete['user_id']);
---
SELECT `user_id`, SUM(calories) as total_calories
FROM `records`
WHERE `type` = 'nourriture'
GROUP BY `user_id`
ORDER BY `total_calories` DESC
 LIMIT 10
SELECT *
FROM `users`
WHERE `users`.`id` = '2'
SELECT `user_id`, SUM(calories) as total_calories
FROM `records`
WHERE `type` = 'activite'
GROUP BY `user_id`
ORDER BY `total_calories` DESC
 LIMIT 10